Tekla.Structures.Drawing.UserDefinedElement
The UserDefinedElement class represents a user-defined attribute specified by its name.
A user-defined element is converted into a textual value before it is drawn.

Tekla.Structures.Drawing.UserDefinedElement._Name
The _ name

Tekla.Structures.Drawing.UserDefinedElement._Value
The _ value

Tekla.Structures.Drawing.UserDefinedElement._Font
The _ font

Tekla.Structures.Drawing.UserDefinedElement._Unit
The _ unit

Tekla.Structures.Drawing.UserDefinedElement.Name
The name of the user-defined attribute.

Tekla.Structures.Drawing.UserDefinedElement.Value
The value of the user-defined attribute.

Tekla.Structures.Drawing.UserDefinedElement.Font
The font of the user-defined attribute.

Tekla.Structures.Drawing.UserDefinedElement.Unit
Gets or sets the unit attributes.

Tekla.Structures.Drawing.UserDefinedElement.#ctor(System.String)
Creates a new user-defined element instance with the given name.
Name: The name to be used.

Tekla.Structures.Drawing.UserDefinedElement.#ctor(System.String,Tekla.Structures.Drawing.FontAttributes)
Creates a new user-defined element instance with the given name and font.
Name: The name to be used.
Font: The font to be used.

Tekla.Structures.Drawing.UserDefinedElement.Clone
Clones the object.
Returns: A copy of the object.

Tekla.Structures.Drawing.UserDefinedElement.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.UserDefinedElement.GetUnformattedString
Returns the content as a string without formatting.
Returns: The content as a string without formatting.